<?php error_reporting(-1); ?>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>ЦИКЛЫ</title>
    <link href="../css/style.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1 class="tred">ЦИКЛЫ</h1>

<?php
/*----------------------------------------------------------------
                           Ц И К Л Ы
-----------------------------------------------------------------*/
$i = 1;
while ($i <= 10) {
    echo $i . "<br>\n";
    $i++;   // $i = $i + 1; $i += 1;
}
echo "<br>\n";
$i = 10;
while ($i >= 1) {
    echo $i . "<br>\n";
    $i--;
}
?>

<h1>ТАБЛИЦА</h1>

<?php
/*----------------------------------------------------------------
                           Т А Б Л И Ц А
-----------------------------------------------------------------*/
$i = 1;
echo "<table border=\"1\">\n";  // таблица
while ($i <= 15) {              // строки
    echo "\t<tr>\n";
    $n = 1;                     // кол-во ячеек (столбцов)
    while ($n <= 5) {
        echo "\t\t<td>Row $i | Col - $n</td>\n";
        $n++;
    }
    echo "\t</tr>\n";
    $i++;
}
echo "</table>\n";
?>

<h1>SELECT/OPTIONS</h1>

<?php
/*----------------------------------------------------------------
                           S E L E C T
-----------------------------------------------------------------*/
$year  = 1900;
echo '<select>' . "\n";
while($year <= 2020) {
    echo "\t<option value='$year'>$year</option>\n";
    $year++;
}
echo "</select>\n";
?>

<h1>DO-WHILE</h1>

<?php
/*-----------------------------------------------------------
                            DO-WHILE
-----------------------------------------------------------------*/
// WHILE (условие-выполнение)
$i = 11;
while ($i <= 10) {
    echo $i++ . "<br>\n";
}

// DO-WHILE (выполнение-условие)
$i = 11;
do{
    echo $i++ . "<br>\n";
}while($i <= 10);

?>

<br><br><br><br><br>

</body>
</html>

